tests/data/pisofoam_restart/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
686
(
(1.13402302332156868 0.503417548289585737 -1.65366554892094194e-15)
(1.14798790275040474 0.589422329209074003 -1.63954865819284986e-15)
(1.16085445011185295 0.668683485752834983 -1.63719251849161455e-15)
(1.19086340231207632 0.759494663290381178 -1.63340665044381281e-15)
(1.20809622126537231 0.860929050219737091 -1.61832072768452768e-15)
(1.2884549383269106 0.816015678814391299 -1.59557332952551062e-15)
(1.00386330049358019 1.08822389070486647 -1.74845734478083659e-15)
(1.31068205120512427 0.40444957835910178 -1.694641649194656e-15)
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            fixedValue;
        value           uniform ( 1 0 0 );
    }
    outflow
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
