tests/data/pisofoam_restart/0/U_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
686
(
(1.13049257615827425 0.500676747445764403 -1.67087679661951747e-15)
(1.14369820494264807 0.586742460663661869 -1.65747980368302403e-15)
(1.15886402252805598 0.666799337625014643 -1.65507526883188251e-15)
(1.19126914138530116 0.758844506231083127 -1.64943960081864465e-15)
(1.20811963735237216 0.859898298619630408 -1.63204000786370411e-15)
(1.28442394863127651 0.815282385346877803 -1.60755275406063484e-15)
(1.00447023610108088 1.08546363318363648 -1.75692939303359897e-15)
(1.31182610333234306 0.401567737353646426 -1.70447297705251088e-15)
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            fixedValue;
        value           uniform ( 1 0 0 );
    }
    outflow
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
