tests/data/pisofoam_restart/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
686
(
2.11509966366036043e-11
2.110700147648636e-11
2.12824236599929054e-11
2.14943810222924663e-11
2.20341414442602504e-11
2.75907925797579571e-11
2.04048397667212848e-08
2.11565960549848609e-11
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            fixedValue;
        value           uniform 1.00000000000000004e-10;
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            fixedValue;
        value           uniform 9.99999999999999955e-08;
    }
    outflow
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
