tests/data/pisofoam_restart/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   nonuniform List<scalar> 
686
(
-0.235986619226226962
-0.293537082933850724
-0.365176235055183096
-0.447418047430538979
-0.533839911637979503
-0.60927845441614259
-0.750206310239554752
-0.439659037792451746
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
    }
    wall
    {
        type            zeroGradient;
    }
    near
    {
        type            cyclic;
    }
    inflow
    {
        type            zeroGradient;
    }
    outflow
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
