tests/data/pisofoam_restart/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 3 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
1330
(
0.082556873519836857
0.151818015127361011
-0.129945000168080749
-0.10442988820848069
0.0630825119814951429
0.132986368798471283
-0.113512007525301675
0.0463427249481046383
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
        value           nonuniform List<scalar> 
686
(
1.53360429292488046e-17
1.16770974055334518e-17
9.14570269575756709e-18
7.13830183992269707e-18
5.61505465509254395e-18
4.37793008744378422e-18
3.89951155528686867e-18
1.60670547276579369e-17
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    near
    {
        type            cyclic;
        value           nonuniform List<scalar> 
686
(
-1.53360429292488046e-17
-1.16770974055334487e-17
-9.14570269575756709e-18
-7.13830183992269707e-18
-5.61505465509254087e-18
-4.37793008744378422e-18
-3.89951155528686867e-18
-1.60670547276579492e-17
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
-0.253219224108079288
-0.263347992792887453
-0.273881912708517916
-0.284837189281049064
-0.296230676968008311
-0.308079904214523026
-0.320403099926934942
-0.628779010672914751
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
15.9271524137279439
14.9226765710880738
14.2953012352722464
13.9795674438313817
13.0882136939112659
13.1161893098142581
12.0734395519854036
12.3122729269197588
13.3848026737603796
13.3541986271342363
14.2686095744757946
14.5786281595567875
15.2675444223240291
16.230189366784213
1.23895415626831329
1.51861763400112015
1.28582543110014957
1.10963103294943699
1.29058669243802471
1.52049800791643031
1.23710105320053976
)
;
    }
}


// ************************************************************************* //
