tests/data/pisofoam_restart/0/phi_0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi_0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 3 -1 0 0 0 0 ];

internalField   nonuniform List<scalar> 
1330
(
0.0825036693891666728
0.151558713561898012
-0.129621990440371204
-0.10444039278933738
0.0630801699302751678
0.13269445636121055
-0.11327095722736237
0.0464135701998126676
...
)
;

boundaryField
{
    far
    {
        type            cyclic;
        value           nonuniform List<scalar> 
686
(
1.5495649389425819e-17
1.17991542233209807e-17
9.24127330625947345e-18
7.2083689467786969e-18
5.66238379124061568e-18
4.40875018068812787e-18
3.91823342832078506e-18
1.61695621907090597e-17
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    near
    {
        type            cyclic;
        value           nonuniform List<scalar> 
686
(
-1.5495649389425819e-17
-1.17991542233209776e-17
-9.24127330625947499e-18
-7.2083689467786969e-18
-5.66238379124061337e-18
-4.40875018068812787e-18
-3.91823342832078506e-18
-1.61695621907090751e-17
...
)
;
    }
    inflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
35
(
-0.253219224108079288
-0.263347992792887453
-0.273881912708517916
-0.284837189281049064
-0.296230676968008311
-0.308079904214523026
-0.320403099926934942
-0.628779010672914751
...
)
;
    }
    outflow
    {
        type            calculated;
        value           nonuniform List<scalar> 
21
(
15.9277552633233075
14.921693722410172
14.2956735090742431
13.9794669914607859
13.0880366903936558
13.1170350283851569
12.0727696398018622
12.3116390615345654
13.3855767735326125
13.3539169513637699
14.2684281065579928
14.5788168754304284
15.2664551169767559
16.2306676116423212
1.23897954162764923
1.51868694478566746
1.28592172753000766
1.11012006929155138
1.29065747892442073
1.5205600418496521
1.2371428431509095
)
;
    }
}


// ************************************************************************* //
